In [63]:
import pandas as pd
import numpy as np

In [64]:
x=pd.Series([1,2,3,4])
x

0    1
1    2
2    3
3    4
dtype: int64

In [65]:
x=pd.Series([1,2,3,4],index=['1st','2nd','3rd','4th'])
x

1st    1
2nd    2
3rd    3
4th    4
dtype: int64

In [66]:
x.values

array([1, 2, 3, 4], dtype=int64)

In [67]:
x.index

Index(['1st', '2nd', '3rd', '4th'], dtype='object')

In [68]:
x['3rd']

3

In [69]:
x['3rd']=88

In [70]:
x

1st     1
2nd     2
3rd    88
4th     4
dtype: int64

In [71]:
x.idxmax()

'3rd'

In [72]:
x.idxmin()

'1st'

In [73]:
arr=np.array([2,7,8,10,11,13,18])
y=pd.Series(arr)

In [74]:
y

0     2
1     7
2     8
3    10
4    11
5    13
6    18
dtype: int32

In [75]:
y[y>10]

4    11
5    13
6    18
dtype: int32

In [76]:
y+2

0     4
1     9
2    10
3    12
4    13
5    15
6    20
dtype: int32

In [77]:
y-2

0     0
1     5
2     6
3     8
4     9
5    11
6    16
dtype: int32

In [78]:
y*3

0     6
1    21
2    24
3    30
4    33
5    39
6    54
dtype: int32

In [79]:
y.value_counts()

2     1
7     1
8     1
10    1
11    1
13    1
18    1
Name: count, dtype: int64

In [80]:
a=pd.Series([1,2,3,2,3,3,4,8])
a

0    1
1    2
2    3
3    2
4    3
5    3
6    4
7    8
dtype: int64

In [81]:
a.value_counts()

3    3
2    2
1    1
4    1
8    1
Name: count, dtype: int64

In [82]:
a.unique()

array([1, 2, 3, 4, 8], dtype=int64)

In [83]:
a.nunique()

5

In [84]:
a.mode()

0    3
dtype: int64

In [85]:
a.mean()

3.25

In [86]:
a.std()

2.1213203435596424

In [87]:
data=({"Name":["Deepak","Kirthish","Naruto"],"Age":[20,11,17]})
df=pd.DataFrame(data)
df

       Name  Age
0    Deepak   20
1  Kirthish   11
2    Naruto   17

In [88]:
df=pd.read_csv('data.csv')
df

       Name  Age  salary
0    Deepak   20   25000
1  kirthish   15   20000
2    Naruto   17   15000
3    sasuke   18   17000
4   kakashi   35    3000

In [89]:
df.head(3)

       Name  Age  salary
0    Deepak   20   25000
1  kirthish   15   20000
2    Naruto   17   15000

In [90]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Age     5 non-null      int64
 2   salary  5 non-null      int64
dtypes: int64(2), object(1)
memory usage: 252.0+ bytes

In [91]:
df.describe()

             Age        salary
count   5.000000      5.000000
mean   21.000000  16000.000000
std     8.031189   8185.352772
min    15.000000   3000.000000
25%    17.000000  15000.000000
50%    18.000000  17000.000000
75%    20.000000  20000.000000
max    35.000000  25000.000000

In [92]:
Games = [
    ['Deepak',20,'cricket'],
    ['Kirthish',17,'Cricket'],
    ['Naruto',18,'Football'],
    ['Roman',38,'wrestling']
    
]
df_01 = pd.DataFrame(Games,columns=['Name','Age','Game'])

In [93]:
df_01

       Name  Age       Game
0    Deepak   20    cricket
1  Kirthish   17    Cricket
2    Naruto   18   Football
3     Roman   38  wrestling

In [94]:
df_01['Name']

0      Deepak
1    Kirthish
2      Naruto
3       Roman
Name: Name, dtype: object

In [95]:
df_01.iloc[0]

Name     Deepak
Age          20
Game    cricket
Name: 0, dtype: object

In [96]:
df_01.loc[0,'Game']

'cricket'

In [97]:
df_01.iloc[2,2]

'Football'

In [98]:
df_01['city']=['Kanyakumari','Kanyakumari','Leafvillage','losangels']

In [99]:
df_01

       Name  Age       Game         city
0    Deepak   20    cricket  Kanyakumari
1  Kirthish   17    Cricket  Kanyakumari
2    Naruto   18   Football  Leafvillage
3     Roman   38  wrestling    losangels

In [100]:
df_01.iloc[2,1]

18

In [101]:
#delete column city from games
df_01.drop('city',axis=1,inplace=True)

In [102]:
df_01

       Name  Age       Game
0    Deepak   20    cricket
1  Kirthish   17    Cricket
2    Naruto   18   Football
3     Roman   38  wrestling

In [103]:
df_01['score']=[180,170,32,60]
df_01

       Name  Age       Game  score
0    Deepak   20    cricket    180
1  Kirthish   17    Cricket    170
2    Naruto   18   Football     32
3     Roman   38  wrestling     60

In [104]:
#add new value
new_vale={"Name":"sethrollings","Age":37,"Game":"Wrestling","score":170}
df=pd.concat([df_01,pd.DataFrame([new_vale])],ignore_index=True)

In [105]:
df

           Name  Age       Game  score
0        Deepak   20    cricket    180
1      Kirthish   17    Cricket    170
2        Naruto   18   Football     32
3         Roman   38  wrestling     60
4  sethrollings   37  Wrestling    170

In [106]:
#update a particular data
df.at[1,'score']=195

In [107]:
df

           Name  Age       Game  score
0        Deepak   20    cricket    180
1      Kirthish   17    Cricket    195
2        Naruto   18   Football     32
3         Roman   38  wrestling     60
4  sethrollings   37  Wrestling    170

In [108]:
df.at[1,'Game']='cricket'
df

           Name  Age       Game  score
0        Deepak   20    cricket    180
1      Kirthish   17    cricket    195
2        Naruto   18   Football     32
3         Roman   38  wrestling     60
4  sethrollings   37  Wrestling    170

In [109]:
df.at[2,'Game']='Boxing'
df

           Name  Age       Game  score
0        Deepak   20    cricket    180
1      Kirthish   17    cricket    195
2        Naruto   18     Boxing     32
3         Roman   38  wrestling     60
4  sethrollings   37  Wrestling    170

In [110]:
df.loc[df['Name']=='Roman','score']=120
df

           Name  Age       Game  score
0        Deepak   20    cricket    180
1      Kirthish   17    cricket    195
2        Naruto   18     Boxing     32
3         Roman   38  wrestling    120
4  sethrollings   37  Wrestling    170

In [111]:
#filter
fil=df[(df['score'] >150) & (df['Game'] == 'cricket')]
fil

       Name  Age     Game  score
0    Deepak   20  cricket    180
1  Kirthish   17  cricket    195

In [112]:
#sort df
df.sort_values('Age',ascending=False)
df

           Name  Age       Game  score
0        Deepak   20    cricket    180
1      Kirthish   17    cricket    195
2        Naruto   18     Boxing     32
3         Roman   38  wrestling    120
4  sethrollings   37  Wrestling    170

In [113]:
data={"Name":['Naruto','Kakashi','Jiraya','Orachimaru','Madara','itachi'],"Age":[18,28,56,56,65,26]}
df=pd.DataFrame(data)
df

         Name  Age
0      Naruto   18
1     Kakashi   28
2      Jiraya   56
3  Orachimaru   56
4      Madara   65
5      itachi   26

In [114]:
df['Rank']=[3,2,None,4,None,1]
df

         Name  Age  Rank
0      Naruto   18   3.0
1     Kakashi   28   2.0
2      Jiraya   56   NaN
3  Orachimaru   56   4.0
4      Madara   65   NaN
5      itachi   26   1.0

In [115]:
#df.fillna(1,inplace=True)
#df

In [116]:
df

         Name  Age  Rank
0      Naruto   18   3.0
1     Kakashi   28   2.0
2      Jiraya   56   NaN
3  Orachimaru   56   4.0
4      Madara   65   NaN
5      itachi   26   1.0

In [117]:
df.dropna(inplace=True)
df

         Name  Age  Rank
0      Naruto   18   3.0
1     Kakashi   28   2.0
3  Orachimaru   56   4.0
5      itachi   26   1.0

In [118]:
#Merge
df_1=pd.DataFrame({"ID":[1,2,3],"Name":['Deepak','Kirthish','Demon']})
df_2=pd.DataFrame({"ID":[1,2,3],"salary":[2000,5000,4500]})

In [119]:
df_1

   ID      Name
0   1    Deepak
1   2  Kirthish
2   3     Demon

In [120]:
df_2

   ID  salary
0   1    2000
1   2    5000
2   3    4500

In [121]:
Mrg=pd.merge(df_1,df_2,on='ID')
Mrg

   ID      Name  salary
0   1    Deepak    2000
1   2  Kirthish    5000
2   3     Demon    4500

In [122]:
#joint
df_1.set_index('ID',inplace=True)
df_2.set_index('ID',inplace=True)
join=df_1.join(df_2)
join

        Name  salary
ID
1     Deepak    2000
2   Kirthish    5000
3      Demon    4500

In [126]:
data1=[
    ['Demon',20,30000],
    ['Naruto',18,25000],
    ['Roman',38,32000]
]
df=pd.DataFrame(data1,columns=(['Name','Age','Salary']))

In [127]:
df

     Name  Age  Salary
0   Demon   20   30000
1  Naruto   18   25000
2   Roman   38   32000

In [146]:
df

     Name  Age  Salary
0   Demon   20   30000
1  Naruto   18   25000
2   Roman   38   32000

In [148]:
df['Date_of_join']=pd.to_datetime(['2025-01-25','2025-01-18','2024-12-31'])

In [149]:
df

     Name  Age  Salary Date_of_join
0   Demon   20   30000   2025-01-25
1  Naruto   18   25000   2025-01-18
2   Roman   38   32000   2024-12-31

In [155]:
#Export data as csv
df.to_csv("New_data.csv",index=False)

In [156]:
df=pd.read_csv('New_data.csv')
df

   Unnamed: 0    Name  Age  Salary Date_of_join
0           0   Demon   20   30000   2025-01-25
1           1  Naruto   18   25000   2025-01-18
2           2   Roman   38   32000   2024-12-31